любит("Таня", яблоки).
любит("Сергей", бананы).
любит("Андрей", яблоки).
любит("Света", карамель).
любит("Вова", карамель).
любит("Таня", халва).
любит("Света", апельсины).
любит("Вова", бананы).

фрукты(яблоки).
фрукты(бананы).
фрукты(апельсины).

сладкое(карамель).
сладкое(халва).

любит_фрукты(Х) :-
    любит(Х, Y),
    фрукты(Y).

любит_сладкое(Х) :-
    любит(Х, Y),
    сладкое(Y).

любит_вкусное(Х) :-
    любит_фрукты(Х),
    любит_сладкое(Х).


% a) любит_фрукты(Кто).
% b) любит_сладкое(Кто).
% c) любит_вкусное(Кто).