% Задание 5

родитель("Михаил", "Алексей").
родитель("Евдокия", "Алексей").

родитель("Алексей", "Федор").
родитель("Мария", "Федор").

родитель("Алексей", "Софья").
родитель("Мария", "Софья").

родитель("Алексей", "Иоанн").
родитель("Мария", "Иоанн").

родитель("Алексей", "Петр").
родитель("Наталья", "Петр").

родитель("Петр", "Анна").
родитель("Екатерина", "Анна").

родитель("Петр", "Елизавета").
родитель("Екатерина", "Елизавета").

мужчина("Михаил").
мужчина("Алексей").
мужчина("Федор").
мужчина("Петр").
мужчина("Иоанн").

женщина("Евдокия").
женщина("Мария").
женщина("Софья").
женщина("Наталья").
женщина("Екатерина").
женщина("Анна").
женщина("Елизавета").


мать(Кто, Кого) :-
    родитель(Кто, Кого),
    женщина(Кто).

отец(Кто, Кого) :-
    родитель(Кто, Кого),
    мужчина(Кто).

сын(Кто, Кого) :-
    родитель(Кого, Кто),
    мужчина(Кто).

дочь(Кто, Кого) :-
    родитель(Кого, Кто),
    женщина(Кто).

дед(Прародитель, Потомок) :-
    мужчина(Прародитель),
    родитель(Прародитель, Родитель),
    родитель(Родитель, Потомок).

бабушка(Прародитель, Потомок) :-
    женщина(Прародитель),
    родитель(Прародитель, Родитель),
    родитель(Родитель, Потомок).

внук(Потомок, Прародитель) :-
    мужчина(Потомок),
    родитель(Прародитель, Родитель),
    родитель(Родитель, Потомок).

внучка(Потомок, Прародитель) :-
    женщина(Потомок),
    родитель(Прародитель, Родитель),
    родитель(Родитель, Потомок).

дети_родителей(Кто, Кого) :-
    (
        (отец(Отец, Кто), отец(Отец, Кого))
        ;
        (
            мать(Мать, Кто),
            мать(Мать, Кого),
            \+ (отец(Отец, Кто), отец(Отец, Кого))
        )
    ),
    Кто \= Кого.

брат(Кто, Кого) :-
    мужчина(Кто),
    дети_родителей(Кто, Кого).

сестра(Кто, Кого) :-
    женщина(Кто),
    дети_родителей(Кто, Кого).

племянница(Кто, Кого) :-
    дети_родителей(Родитель, Кого),
    дочь(Кто, Родитель).

родители(Родитель1, Родитель2) :- 
    (
    (отец(Родитель1, Ребенок), мать(Родитель2, Ребенок)), 
    \+ (отец(Родитель2, Ребенок), мать(Родитель1, Ребенок))
    ),  
    Родитель1\==Родитель2.

% 1) бабушка(Кто, Кого).

% 2) внук(Кто, "Евдокия").

% 3) брат(Кто, "Иоанн").
%    брат("Иоанн", Кого).

% 4) сестра(Кто, "Федор").