фамилия(белокуров).
фамилия(рыжов).
фамилия(чернов).

цвет(блондин).
цвет(брюнет).
цвет(рыжий).

соответствие(белокуров, Цвет) :-
    цвет(Цвет),
    Цвет \= блондин,
    Цвет \= брюнет.

соответствие(рыжов, Цвет) :-
    цвет(Цвет),
    Цвет \= рыжий.

соответствие(чернов, Цвет) :-
    цвет(Цвет),
    Цвет \= брюнет.

решение(Цвет1, Цвет2, Цвет3) :-
    соответствие(белокуров, Цвет1),
    соответствие(рыжов, Цвет2),
    соответствие(чернов, Цвет3),
    Цвет1 \= Цвет2,
    Цвет2 \= Цвет3,
    Цвет1 \= Цвет3.

% ?- решение(Белокуров, Рыжов, Чернов).