дерево(ель).
дерево(сосна).
дерево(тополь).
дерево(береза).
дерево(липа).
дерево(клен).

выше(тополь, береза).
выше(береза, липа).
выше(липа, клен).
выше(сосна, тополь).
выше(ель, сосна).

% В заданной цепочке самое высокое дерево — то, выше которого нет другого.
самое_высокое(X) :-
    дерево(X),
    \+ выше(_, X).

% Самое низкое дерево — то, ниже которого нет другого.
самое_низкое(X) :-
    дерево(X),
    \+ выше(X, _).

% Решение
решение(Высокое, Низкое) :-
    самое_высокое(Высокое),
    самое_низкое(Низкое).

% ?- решение(Высокое, Низкое).
