# слово("дом", "house").
# слово("машина", "car").
# слово("книга", "book").
# слово("кошка", "cat").
# слово("собака", "dog").

# слово("мир", "world").
# слово("мир", "peace").

# слово("ключ", "key").
# слово("ключ", "spring").


% вывод всего словаря
словарь(Русское, Английское) :-
    слово(Русское, Английское).

% перевод с русского на английский
рус_англ(Русское, Английское) :-
    слово(Русское, Английское).

% перевод с английского на русский
англ_рус(Английское, Русское) :-
    слово(Русское, Английское).

% a) словарь(Русское, Английское).
% b) рус_англ("мир", Перевод).
% c) англ_рус("key", Перевод).