# страна("Россия", "Москва", 146, европа).
# страна("Германия", "Берлин", 84, европа).
# страна("Франция", "Париж", 68, европа).
# страна("Италия", "Рим", 59, европа).
# страна("Китай", "Пекин", 1400, азия).
# страна("Япония", "Токио", 124, азия).


% а) вся информация из справочника
вся_информация(Страна, Столица, Население, Положение) :-
    страна(Страна, Столица, Население, Положение).

% б) страны, население которых превышает заданное значение
население_больше(Значение, Страна, Столица, Население, Положение) :-
    страна(Страна, Столица, Население, Положение),
    Население > Значение.

% в) европейские страны, население которых не превышает заданное значение
европа_население_не_больше(Значение, Страна, Столица, Население) :-
    страна(Страна, Столица, Население, европа),
    Население =< Значение.


% a) вся_информация(Страна, Столица, Население, Положение).
% b) население_больше(100, Страна, Столица, Население, Положение).
% c) европа_население_не_больше(70, Страна, Столица, Население).