% а) женщины, отдыхающие в России
женщина_в_россии(Имя) :- женщина(Имя), отдыхает(Имя, Город), россия(Город).

% б) мужчины, отдыхающие в Италии
мужчина_в_италии(Имя) :- мужчина(Имя), отдыхает(Имя, Город), италия(Город).

% a) женщина_в_россии(Кто).
% b) мужчина_в_италии(Кто).

# % кто где отдыхает
# отдыхает("Анна", москва).
# отдыхает("Ольга", рим).
# отдыхает("Иван", милан).
# отдыхает("Петр", сочи).

# % города
# россия(москва).
# россия(сочи).

# италия(рим).
# италия(милан).

# % пол
# женщина("Анна").
# женщина("Ольга").

# мужчина("Иван").
# мужчина("Петр").